#ifndef _LOG_WIN_H_
#define _LOG_WIN_H_


#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdarg.h>
#include <time.h>

#ifdef __cplusplus
extern "C" 
{
#endif

#ifdef CLIB_EXPORTS
	#define CLIB_API __declspec(dllexport)
#else
	#define CLIB_API __declspec(dllimport)
#endif
	   
/******************************************************************************
* 함 수 명 : GW_LogInit_win
*------------------------------------------------------------------------------
* 입력인자 :
*		const char*     pSavePath	- 저장 경로
*
* 출력인자 :
*
* 리 턴 값 :
*       성공    - EXIT_SUCCESS (0)
*       실패    - EXIT_FAILURE (1)
*------------------------------------------------------------------------------
* 기    능 : 로그를 저장 경로를 초기화 해준다.
*------------------------------------------------------------------------------
* 비	고 : 전역변수(메모리)로 FILE* 를 관리(g_pFile)
*       파일오픈 append 모드 fopen_s(&pFile, pSavePath, "ab")
******************************************************************************/
CLIB_API int GW_LogInit_win(const char *pSavePath);

/******************************************************************************
* 함 수 명 : GW_LogTrace
*------------------------------------------------------------------------------
* 입력인자 :
*		const char*        format, ...	- printf 형태의 포맷
*
* 출력인자 :
*
* 리 턴 값 :
*       성공    - EXIT_SUCCESS (0)
*       실패    - EXIT_FAILURE (1)
*------------------------------------------------------------------------------
* 기    능 : 로그를 저장한다.
*------------------------------------------------------------------------------
* 비	고 : 전역변수(메모리)로 FILE*에 로그를 저장 내부에서 GW_writeFile 호출
******************************************************************************/
CLIB_API int GW_LogTrace_win(const char* format, ...);

/******************************************************************************
* 함 수 명 : GW_LogClose
*------------------------------------------------------------------------------
* 입력인자 :
*
* 출력인자 :
*
* 리 턴 값 :
*       성공    - EXIT_SUCCESS (0)
*       실패    - EXIT_FAILURE (1)
*------------------------------------------------------------------------------
* 기    능 : File을  fclose로 닫아준다.
*------------------------------------------------------------------------------
* 비	고 : 전역변수(메모리)로 FILE*을 닫아준다.
******************************************************************************/
CLIB_API int GW_LogClose_win();

#ifdef __cplusplus
}
#endif

#endif
